InformationRegisters/ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиПланированияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлательщикПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоступлениеСписание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПереводаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта после конвертации (поступления)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отгружается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для реализации товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСКлиентами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПереводовДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыПереводовДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтБанкаПоЭквайрингу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ГрафикПлатежей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьБлокировкиДанныхДляРасчетаГрафика(ТаблицаОбъектовОплаты, ИмяТаблицы, ИмяПоля) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = ТаблицаОбъектовОплаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ИмяПоля, "ОбъектОплаты");
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура РассчитатьГрафикПлатежейПоРасчетамСКлиентами(ДокументыОплаты, Очередь = Неопределено) Экспорт
	
	ОбъектыОплаты = Новый Массив;
	ОбъектыРасчетов = Новый Массив;
	Возвраты = Новый Массив;
	
	НеОбрабатываемые = Новый Массив;
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ОперацияПоЯндексКассе"));
	
	Для каждого ДокументОплаты Из ДокументыОплаты Цикл
		Если НеОбрабатываемые.Найти(ТипЗнч(ДокументОплаты)) = Неопределено Тогда
			ОбъектыОплаты.Добавить(ДокументОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ОбъектОплаты Из ОбъектыОплаты Цикл
		Если ТипЗнч(ОбъектОплаты) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
			Или ТипЗнч(ОбъектОплаты) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			Возвраты.Добавить(ОбъектОплаты);
		Иначе
			ОбъектыРасчетов.Добавить(ОбъектОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектыРасчетов.Количество() Тогда
		ЗаписатьГрафикПлатежейПоРасчетам(
			ОбъектыРасчетов,
			ТекстЗапросаГрафикПлатежейПоРасчетамСКлиентами(),
			Перечисления.ТипыДвиженияДенежныхСредств.Поступление,
			Перечисления.ОбластиПланированияПлатежей.РасчетыСКлиентами,
			Очередь);
	КонецЕсли;
	
	Если Возвраты.Количество() Тогда
		ЗаписатьГрафикПлатежейПоРасчетам(
			Возвраты,
			ТекстЗапросаГрафикПлатежейПоВозвратамКлиентам(),
			Перечисления.ТипыДвиженияДенежныхСредств.Списание,
			Перечисления.ОбластиПланированияПлатежей.ВозвратыКлиентам,
			Очередь);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьГрафикПлатежейПоРасчетамСПоставщиками(ДокументыОплаты, Очередь = Неопределено) Экспорт
	
	ОбъектыОплаты = Новый Массив;
	ОбъектыРасчетов = Новый Массив;
	Возвраты = Новый Массив;
	
	НеОбрабатываемые = Новый Массив;
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"));
	НеОбрабатываемые.Добавить(Тип("ДокументСсылка.ОперацияПоЯндексКассе"));
	
	Для каждого ДокументОплаты Из ДокументыОплаты Цикл
		Если НеОбрабатываемые.Найти(ТипЗнч(ДокументОплаты)) = Неопределено Тогда
			ОбъектыОплаты.Добавить(ДокументОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ОбъектОплаты Из ОбъектыОплаты Цикл
		Если ТипЗнч(ОбъектОплаты) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			Возвраты.Добавить(ОбъектОплаты);
		Иначе
			ОбъектыРасчетов.Добавить(ОбъектОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектыРасчетов.Количество() Тогда
		ЗаписатьГрафикПлатежейПоРасчетам(
			ОбъектыОплаты,
			ТекстЗапросаГрафикПлатежейПоРасчетамСПоставщиками(),
			Перечисления.ТипыДвиженияДенежныхСредств.Списание,
			Перечисления.ОбластиПланированияПлатежей.РасчетыСПоставщиками,
			Очередь);
	КонецЕсли;
	
	Если Возвраты.Количество() Тогда
		ЗаписатьГрафикПлатежейПоРасчетам(
			Возвраты,
			ТекстЗапросаГрафикПлатежейПоВозвратамОтПоставщиков(),
			Перечисления.ТипыДвиженияДенежныхСредств.Поступление,
			Перечисления.ОбластиПланированияПлатежей.ВозвратыОтПоставщиков,
			Очередь);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьГрафикПлатежейПоДенежнымСредствамКВыплате(ОбъектыОплаты, Очередь = Неопределено) Экспорт
	
	Заявки = Новый Массив;
	Распоряжения = Новый Массив;
	
	Для каждого ОбъектОплаты Из ОбъектыОплаты Цикл
		Если ТипЗнч(ОбъектОплаты) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			Заявки.Добавить(ОбъектОплаты);
		ИначеЕсли ТипЗнч(ОбъектОплаты) = Тип("ДокументСсылка.РаспоряжениеНаПеремещениеДенежныхСредств") Тогда
			Распоряжения.Добавить(ОбъектОплаты);
		КонецЕсли;
	КонецЦикла;
	
	Если Заявки.Количество() Тогда
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ЗаявкаНаРасходованиеДенежныхСредств");
		ТекстЗапроса = ТекстЗапросаГрафикПлатежейПоЗаявкам();
		ЗаписатьГрафикПлатежейПоДенежнымСредствамКВыплате(Заявки, ТекстЗапроса, ИдентификаторОбъектаМетаданных, Очередь);
	КонецЕсли;
	
	Если Распоряжения.Количество() Тогда
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РаспоряжениеНаПеремещениеДенежныхСредств");
		ТекстЗапроса = ТекстЗапросаГрафикПлатежейПоРаспоряжениямНаОплату();
		ЗаписатьГрафикПлатежейПоДенежнымСредствамКВыплате(Распоряжения, ТекстЗапроса, ИдентификаторОбъектаМетаданных, Очередь);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьГрафикПлатежейПоДенежнымСредствамВПути(ТаблицаОбъектовОплаты, Очередь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДенежныеСредства.Отправитель КАК ОбъектОплаты,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ВЫБОР ДенежныеСредства.ВидПереводаДенежныхСредств
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк) ТОГДА
	|			ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, ЕСТЬNULL(ВЫРАЗИТЬ(ДенежныеСредства.Отправитель КАК Справочник.Кассы).СрокИнкассации, 1))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка) ТОГДА
	|			ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, ЕСТЬNULL(ВЫРАЗИТЬ(ДенежныеСредства.Получатель КАК Справочник.Кассы).СрокИнкассации, 1))
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет) ТОГДА
	|			ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, 1)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу) ТОГДА
	|			ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, ЕСТЬNULL(ВЫРАЗИТЬ(ДенежныеСредства.Отправитель КАК Справочник.Кассы).СрокИнкассации, 1))
	|	КОНЕЦ КАК ДатаПлатежа,
	|	ДенежныеСредства.Организация КАК ПлательщикПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление) КАК ПоступлениеСписание,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	ДенежныеСредства.Организация КАК Организация,
	|	ДенежныеСредства.Получатель.Подразделение КАК Подразделение,
	|	ДенежныеСредства.Получатель.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	
	|	ВЫБОР ДенежныеСредства.ВидПереводаДенежныхСредств
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствИзБанка)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствСДругогоСчета)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.Кассы)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ДенежныеСредства.Отправитель) = ТИП(Справочник.КассыККМ)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.КассыККМ) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.БанковскиеСчетаОрганизаций) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	КОНЕЦ КАК ФормаОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ДенежныеСредстваВПути) КАК ОбластьПланирования
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(,
	|		ВидПереводаДенежныхСредств В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу)
	|		)
	|		И Получатель В (&БанковскийСчетКасса)
	|		И Отправитель В (&ОбъектОплаты)
	|	) КАК ДенежныеСредства
	|	
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредства.Контрагент КАК ОбъектОплаты,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, 1) КАК ДатаПлатежа,
	|	ДенежныеСредства.Контрагент КАК ПлательщикПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление) КАК ПоступлениеСписание,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	ДенежныеСредства.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ДенежныеСредства.Получатель КАК Справочник.БанковскиеСчетаОрганизаций).Подразделение,
	|	ВЫРАЗИТЬ(ДенежныеСредства.Получатель КАК Справочник.БанковскиеСчетаОрганизаций).НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.Кассы) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.БанковскиеСчетаОрганизаций) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	КОНЕЦ КАК ФормаОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ДенежныеСредстваВПути) КАК ОбластьПланирования
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(,
	|		ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПоступлениеОтБанкаПоЭквайрингу)
	|		И Получатель В (&БанковскийСчетКасса)
	|		И Контрагент В (&ОбъектОплаты)
	|	) КАК ДенежныеСредства
	|	
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредства.Контрагент КАК ОбъектОплаты,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ДОБАВИТЬКДАТЕ(&ДатаРасчета, ДЕНЬ, 1) КАК ДатаПлатежа,
	|	ДенежныеСредства.Контрагент КАК ПлательщикПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление) КАК ПоступлениеСписание,
	|	ДенежныеСредства.Получатель.ВалютаДенежныхСредств КАК Валюта,
	|	
	|	СУММА(ВЫБОР КОГДА КурсВалютыОтправителя.Кратность <> 0 И КурсВалютыПолучателя.Курс <> 0 ТОГДА
	|		ДенежныеСредства.СуммаОстаток *
	|			КурсВалютыОтправителя.Курс * КурсВалютыПолучателя.Кратность / (КурсВалютыОтправителя.Кратность * КурсВалютыПолучателя.Курс)
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ) КАК Сумма,
	|	
	|	ДенежныеСредства.Организация КАК Организация,
	|	ДенежныеСредства.Получатель.Подразделение,
	|	ДенежныеСредства.Получатель.НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.Кассы) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.БанковскиеСчетаОрганизаций) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	КОНЕЦ КАК ФормаОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ДенежныеСредстваВПути) КАК ОбластьПланирования
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(,
	|		ВидПереводаДенежныхСредств В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|		)
	|		И Получатель В (&БанковскийСчетКасса)
	|		И Контрагент В (&ОбъектОплаты)
	|	) КАК ДенежныеСредства
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРасчета) КАК КурсВалютыОтправителя
	|	ПО КурсВалютыОтправителя.Валюта = ДенежныеСредства.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРасчета) КАК КурсВалютыПолучателя
	|	ПО КурсВалютыПолучателя.Валюта = ДенежныеСредства.Получатель.ВалютаДенежныхСредств
	|	
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредства.Контрагент,
	|	ДенежныеСредства.Получатель,
	|	ДенежныеСредства.Организация
	|";
	
	Запрос.УстановитьПараметр("ОбъектОплаты", ТаблицаОбъектовОплаты.ВыгрузитьКолонку("ОбъектОплаты"));
	Запрос.УстановитьПараметр("БанковскийСчетКасса", ТаблицаОбъектовОплаты.ВыгрузитьКолонку("БанковскийСчетКасса"));
	Запрос.УстановитьПараметр("ДатаРасчета", КонецДня(ТекущаяДатаСеанса()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для каждого СтрокаОбъектОплаты из ТаблицаОбъектовОплаты Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ОбъектОплаты", СтрокаОбъектОплаты.ОбъектОплаты);
		СтруктураПоиска.Вставить("БанковскийСчетКасса", СтрокаОбъектОплаты.БанковскийСчетКасса);
		
		НаборЗаписей = РегистрыСведений.ГрафикПлатежей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектОплаты.Установить(СтрокаОбъектОплаты.ОбъектОплаты);
		НаборЗаписей.Отбор.БанковскийСчетКасса.Установить(СтрокаОбъектОплаты.БанковскийСчетКасса);
		НаборЗаписей.Очистить();
		
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.ТипОбъектаОплаты = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Выборка.ОбъектОплаты));
		КонецЦикла;
		Выборка.Сбросить();
		
		Попытка
			Если Очередь <> Неопределено Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				НаборЗаписей.Записать();
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось записать график платежей по: %1 по причине: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения, СтрокаОбъектОплаты.ОбъектОплаты, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,
				СтрокаОбъектОплаты.ОбъектОплаты, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьГрафикПлатежейПоРасчетам(ОбъектыОплаты, ТекстЗапроса, ПоступлениеСписание, ОбластьПланирования, Очередь)
	
	Если Не ОбъектыОплаты.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПоляГрафика = ИнициализироватьПоляГрафика();
	
	ЗапросыПоТипам = Новый Соответствие;
	ВыборкиПоТипам = Новый Соответствие;
	
	Для каждого ОбъектОплаты из ОбъектыОплаты Цикл
		
		Если Не ЗначениеЗаполнено(ОбъектОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипОбъектаОплаты = ОбщегоНазначения.ИмяТаблицыПоСсылке(ОбъектОплаты);
		Если ЗапросыПоТипам.Получить(ТипОбъектаОплаты) = Неопределено Тогда
			ЗапросыПоТипам.Вставить(ТипОбъектаОплаты,
				ДенежныеСредстваПовтИсп.ТекстЗапросаКэшРеквизитовПлатежа(ТипОбъектаОплаты, ПоляГрафика));
		КонецЕсли;
	КонецЦикла;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	Для каждого ЗапросПоТипу Из ЗапросыПоТипам Цикл
		НовыйЗапрос = СхемаЗапроса.ПакетЗапросов.Добавить();
		НовыйЗапрос.УстановитьТекстЗапроса(ЗапросПоТипу.Значение);
	КонецЦикла;
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		Запрос.УстановитьПараметр("Ссылка", ОбъектыОплаты);
		Результат = Запрос.ВыполнитьПакет();
		инд = 0;
		Для каждого ЗапросПоТипу Из ЗапросыПоТипам Цикл
			ВыборкиПоТипам.Вставить(ЗапросПоТипу.Ключ, Результат[инд].Выбрать());
			инд = инд + 1;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ОбъектыОплаты", ОбъектыОплаты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для каждого ОбъектОплаты из ОбъектыОплаты Цикл
		
		Если Не ЗначениеЗаполнено(ОбъектОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ОбъектОплаты);
		
		НаборЗаписей = РегистрыСведений.ГрафикПлатежей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектОплаты.Установить(ОбъектОплаты);
		НаборЗаписей.Отбор.ПоступлениеСписание.Установить(ПоступлениеСписание);
		
		ТипОбъектаОплаты = ОбщегоНазначения.ИмяТаблицыПоСсылке(ОбъектОплаты);
		
		ВыборкаРеквизитов = ВыборкиПоТипам.Получить(ТипОбъектаОплаты);
		
		Если ВыборкаРеквизитов.НайтиСледующий(СтруктураПоиска) Тогда
			ПоляГрафика = ИнициализироватьПоляГрафика();
			ЗаполнитьЗначенияСвойств(ПоляГрафика, ВыборкаРеквизитов);
		КонецЕсли;
		
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			
			Запись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(Запись, ПоляГрафика);
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.ОбъектОплаты = Выборка.Ссылка;
			Запись.ПоступлениеСписание = ПоступлениеСписание;
			Запись.ОбластьПланирования = ОбластьПланирования;
			
			Запись.БанковскийСчетКасса = Неопределено;
			Если ЗначениеЗаполнено(ПоляГрафика.ФормаОплаты) Тогда
				Если ПоляГрафика.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная Тогда
					Если ЗначениеЗаполнено(ПоляГрафика.БанковскийСчет) Тогда
						Запись.БанковскийСчетКасса = ПоляГрафика.БанковскийСчет;
					ИначеЕсли ЗначениеЗаполнено(ПоляГрафика.БанковскийСчетОрганизации) Тогда
						Запись.БанковскийСчетКасса = ПоляГрафика.БанковскийСчетОрганизации;
					КонецЕсли;
				ИначеЕсли ПоляГрафика.ФормаОплаты = Перечисления.ФормыОплаты.Наличная
					И ЗначениеЗаполнено(ПоляГрафика.Касса) Тогда
					Запись.БанковскийСчетКасса = ПоляГрафика.Касса;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(ПоляГрафика.Касса) Тогда
					Запись.БанковскийСчетКасса = ПоляГрафика.Касса;
				ИначеЕсли ЗначениеЗаполнено(ПоляГрафика.БанковскийСчет) Тогда
					Запись.БанковскийСчетКасса = ПоляГрафика.БанковскийСчет;
				ИначеЕсли ЗначениеЗаполнено(ПоляГрафика.БанковскийСчетОрганизации) Тогда
					Запись.БанковскийСчетКасса = ПоляГрафика.БанковскийСчетОрганизации;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ПоляГрафика.СтатьяДвиженияДенежныхСредств) Тогда
				Если ЗначениеЗаполнено(ПоляГрафика.ДоговорСтатьяДвиженияДенежныхСредств) Тогда
					Запись.СтатьяДвиженияДенежныхСредств = ПоляГрафика.ДоговорСтатьяДвиженияДенежныхСредств;
				ИначеЕсли ЗначениеЗаполнено(ПоляГрафика.СоглашениеСтатьяДвиженияДенежныхСредств) Тогда
					Запись.СтатьяДвиженияДенежныхСредств = ПоляГрафика.СоглашениеСтатьяДвиженияДенежныхСредств;
				Иначе
					Запись.СтатьяДвиженияДенежныхСредств =
						Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ПоляГрафика.ХозяйственнаяОперация);
				КонецЕсли;
			КонецЕсли;
			
			Запись.Ответственный = ПоляГрафика.Менеджер;
			Запись.ТипОбъектаОплаты = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъектаОплаты);
		КонецЦикла;
		Выборка.Сбросить();
		
		Попытка
			Если Очередь <> Неопределено Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				НаборЗаписей.Записать();
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось записать график платежей по: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ОбъектОплаты);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,
				ОбъектОплаты, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьГрафикПлатежейПоДенежнымСредствамКВыплате(ОбъектыОплаты, ТекстЗапроса, ИдентификаторОбъектаМетаданных, Очередь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОбъектыОплаты", ОбъектыОплаты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для каждого ОбъектОплаты из ОбъектыОплаты Цикл
		
		СтруктураПоиска = Новый Структура("ОбъектОплаты", ОбъектОплаты);
		
		НаборЗаписей = РегистрыСведений.ГрафикПлатежей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектОплаты.Установить(ОбъектОплаты);
		
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.ТипОбъектаОплаты = ИдентификаторОбъектаМетаданных;
		КонецЦикла;
		Выборка.Сбросить();
		
		Попытка
			Если Очередь <> Неопределено Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				НаборЗаписей.Записать();
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось записать график платежей по: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ОбъектОплаты);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,
				ОбъектОплаты, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаГрафикПлатежейПоРасчетамСКлиентами()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток КАК КОплате
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
	|			ЗаказКлиента В (&ОбъектыОплаты)
	|		) КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеПриход КАК КОплате
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,
	|			День,
	|			(ЗаказКлиента, АналитикаУчетаПоПартнерам, Валюта) В 
	|			(ВЫБРАТЬ
	|				Остатки.ЗаказКлиента,
	|				Остатки.АналитикаУчетаПоПартнерам,
	|				Остатки.Валюта
	|			ИЗ
	|				Остатки КАК Остатки)
	|		) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.Период КАК ДатаПлатежа,
	|	ГрафикОплаты.ЗаказКлиента КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	
	|	ВЫБОР КОГДА МАКСИМУМ(Остатки.КОплате) - МАКСИМУМ(ГрафикОплаты.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|		ТОГДА
	|			МАКСИМУМ(ГрафикОплаты.КОплате)
	|		ИНАЧЕ
	|			МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0))
	|	КОНЕЦ КАК Сумма
	|	
	|ПОМЕСТИТЬ ГрафикОплатыРассчитанный
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ГрафикОплаты КАК ГрафикОплатыИтог
	|	ПО
	|		ГрафикОплатыИтог.ЗаказКлиента = ГрафикОплаты.ЗаказКлиента
	|		И ГрафикОплатыИтог.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И ГрафикОплатыИтог.Валюта = ГрафикОплаты.Валюта
	|		И ГрафикОплатыИтог.Период > ГрафикОплаты.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Остатки КАК Остатки
	|	ПО
	|		Остатки.ЗаказКлиента = ГрафикОплаты.ЗаказКлиента
	|		И Остатки.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И Остатки.Валюта = ГрафикОплаты.Валюта
	|		
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.Период,
	|	ГрафикОплаты.ЗаказКлиента,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта
	|	
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ГрафикОплаты.Ссылка КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент КАК ПлательщикПолучатель,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	СУММА(ГрафикОплаты.Сумма) КАК Сумма
	|ИЗ
	|	ГрафикОплатыРассчитанный КАК ГрафикОплаты
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.ДатаПлатежа,
	|	ГрафикОплаты.Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация,
	|	ГрафикОплаты.Валюта
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаГрафикПлатежейПоВозвратамКлиентам()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	-(Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток) КАК КОплате
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
	|			ЗаказКлиента В (&ОбъектыОплаты)
	|		) КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеРасход КАК КОплате
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,
	|			День,
	|			(ЗаказКлиента, АналитикаУчетаПоПартнерам, Валюта) В 
	|			(ВЫБРАТЬ
	|				Остатки.ЗаказКлиента,
	|				Остатки.АналитикаУчетаПоПартнерам,
	|				Остатки.Валюта
	|			ИЗ
	|				Остатки КАК Остатки)
	|		) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.Период КАК ДатаПлатежа,
	|	ГрафикОплаты.ЗаказКлиента КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	
	|	ВЫБОР КОГДА МАКСИМУМ(Остатки.КОплате) - МАКСИМУМ(ГрафикОплаты.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|		ТОГДА
	|			МАКСИМУМ(ГрафикОплаты.КОплате)
	|		ИНАЧЕ
	|			МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0))
	|	КОНЕЦ КАК Сумма
	|	
	|ПОМЕСТИТЬ ГрафикОплатыРассчитанный
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ГрафикОплаты КАК ГрафикОплатыИтог
	|	ПО
	|		ГрафикОплатыИтог.ЗаказКлиента = ГрафикОплаты.ЗаказКлиента
	|		И ГрафикОплатыИтог.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И ГрафикОплатыИтог.Валюта = ГрафикОплаты.Валюта
	|		И ГрафикОплатыИтог.Период > ГрафикОплаты.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Остатки КАК Остатки
	|	ПО
	|		Остатки.ЗаказКлиента = ГрафикОплаты.ЗаказКлиента
	|		И Остатки.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И Остатки.Валюта = ГрафикОплаты.Валюта
	|		
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.Период,
	|	ГрафикОплаты.ЗаказКлиента,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта
	|	
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ГрафикОплаты.Ссылка КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент КАК ПлательщикПолучатель,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	СУММА(ГрафикОплаты.Сумма) КАК Сумма
	|ИЗ
	|	ГрафикОплатыРассчитанный КАК ГрафикОплаты
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.ДатаПлатежа,
	|	ГрафикОплаты.Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация,
	|	ГрафикОплаты.Валюта
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаГрафикПлатежейПоРасчетамСПоставщиками()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	-(Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток) КАК КОплате
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
	|			ЗаказПоставщику В (&ОбъектыОплаты)
	|		) КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеРасход КАК КОплате
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,,
	|			День,
	|			(ЗаказПоставщику, АналитикаУчетаПоПартнерам, Валюта) В 
	|			(ВЫБРАТЬ
	|				Остатки.ЗаказПоставщику,
	|				Остатки.АналитикаУчетаПоПартнерам,
	|				Остатки.Валюта
	|			ИЗ
	|				Остатки КАК Остатки)
	|		) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.Период КАК ДатаПлатежа,
	|	ГрафикОплаты.ЗаказПоставщику КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	
	|	ВЫБОР КОГДА МАКСИМУМ(Остатки.КОплате) - МАКСИМУМ(ГрафикОплаты.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|		ТОГДА
	|			МАКСИМУМ(ГрафикОплаты.КОплате)
	|		ИНАЧЕ
	|			МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0))
	|	КОНЕЦ КАК Сумма
	|	
	|ПОМЕСТИТЬ ГрафикОплатыРассчитанный
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ГрафикОплаты КАК ГрафикОплатыИтог
	|	ПО
	|		ГрафикОплатыИтог.ЗаказПоставщику = ГрафикОплаты.ЗаказПоставщику
	|		И ГрафикОплатыИтог.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И ГрафикОплатыИтог.Валюта = ГрафикОплаты.Валюта
	|		И ГрафикОплатыИтог.Период > ГрафикОплаты.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Остатки КАК Остатки
	|	ПО
	|		Остатки.ЗаказПоставщику = ГрафикОплаты.ЗаказПоставщику
	|		И Остатки.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И Остатки.Валюта = ГрафикОплаты.Валюта
	|		
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.Период,
	|	ГрафикОплаты.ЗаказПоставщику,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта
	|	
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ГрафикОплаты.Ссылка КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент КАК ПлательщикПолучатель,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	СУММА(ГрафикОплаты.Сумма) КАК Сумма
	|ИЗ
	|	ГрафикОплатыРассчитанный КАК ГрафикОплаты
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.ДатаПлатежа,
	|	ГрафикОплаты.Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация,
	|	ГрафикОплаты.Валюта
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаГрафикПлатежейПоВозвратамОтПоставщиков()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток КАК КОплате
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
	|			ЗаказПоставщику В (&ОбъектыОплаты)
	|		) КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.КОплатеПриход КАК КОплате
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(,,
	|			День,
	|			(ЗаказПоставщику, АналитикаУчетаПоПартнерам, Валюта) В 
	|			(ВЫБРАТЬ
	|				Остатки.ЗаказПоставщику,
	|				Остатки.АналитикаУчетаПоПартнерам,
	|				Остатки.Валюта
	|			ИЗ
	|				Остатки КАК Остатки)
	|		) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.Период КАК ДатаПлатежа,
	|	ГрафикОплаты.ЗаказПоставщику КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	
	|	ВЫБОР КОГДА МАКСИМУМ(Остатки.КОплате) - МАКСИМУМ(ГрафикОплаты.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|		ТОГДА
	|			МАКСИМУМ(ГрафикОплаты.КОплате)
	|		ИНАЧЕ
	|			МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0))
	|	КОНЕЦ КАК Сумма
	|	
	|ПОМЕСТИТЬ ГрафикОплатыРассчитанный
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ГрафикОплаты КАК ГрафикОплатыИтог
	|	ПО
	|		ГрафикОплатыИтог.ЗаказПоставщику = ГрафикОплаты.ЗаказПоставщику
	|		И ГрафикОплатыИтог.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И ГрафикОплатыИтог.Валюта = ГрафикОплаты.Валюта
	|		И ГрафикОплатыИтог.Период > ГрафикОплаты.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Остатки КАК Остатки
	|	ПО
	|		Остатки.ЗаказПоставщику = ГрафикОплаты.ЗаказПоставщику
	|		И Остатки.АналитикаУчетаПоПартнерам = ГрафикОплаты.АналитикаУчетаПоПартнерам
	|		И Остатки.Валюта = ГрафикОплаты.Валюта
	|		
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.Период,
	|	ГрафикОплаты.ЗаказПоставщику,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам,
	|	ГрафикОплаты.Валюта
	|	
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Остатки.КОплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КОплате, 0)) > 0
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ГрафикОплаты.Ссылка КАК Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент КАК ПлательщикПолучатель,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ГрафикОплаты.Валюта КАК Валюта,
	|	СУММА(ГрафикОплаты.Сумма) КАК Сумма
	|ИЗ
	|	ГрафикОплатыРассчитанный КАК ГрафикОплаты
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.ДатаПлатежа,
	|	ГрафикОплаты.Ссылка,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Контрагент,
	|	ГрафикОплаты.АналитикаУчетаПоПартнерам.Организация,
	|	ГрафикОплаты.Валюта
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаГрафикПлатежейПоЗаявкам()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.СуммаОстаток КАК КВыплате
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(,
	|			ЗаявкаНаРасходованиеДенежныхСредств В (&ОбъектыОплаты)
	|		) КАК ДенежныеСредства
	|
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеДенежныхСредств,
	|	БанковскийСчетКасса
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.СуммаПриход КАК КВыплате
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Обороты(,,
	|			День,
	|			(ЗаявкаНаРасходованиеДенежныхСредств, БанковскийСчетКасса) В
	|			(ВЫБРАТЬ
	|				Остатки.Заявка,
	|				Остатки.БанковскийСчетКасса
	|			ИЗ
	|				Остатки КАК Остатки)
	|		) КАК ДенежныеСредства
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаРасходованиеДенежныхСредств,
	|	БанковскийСчетКасса
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикОплаты.Период КАК ДатаПлатежа,
	|	ГрафикОплаты.Заявка КАК Ссылка,
	|	ГрафикОплаты.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА МАКСИМУМ(Остатки.КВыплате) - МАКСИМУМ(ГрафикОплаты.КВыплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КВыплате, 0)) > 0
	|		ТОГДА
	|			МАКСИМУМ(ГрафикОплаты.КВыплате)
	|		ИНАЧЕ
	|			МАКСИМУМ(Остатки.КВыплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КВыплате, 0))
	|	КОНЕЦ КАК Сумма
	|
	|ПОМЕСТИТЬ ГрафикПлатежейИтог
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ГрафикОплаты КАК ГрафикОплатыИтог
	|	ПО
	|		ГрафикОплатыИтог.Заявка = ГрафикОплаты.Заявка
	|		И ГрафикОплатыИтог.БанковскийСчетКасса = ГрафикОплаты.БанковскийСчетКасса
	|		И ГрафикОплатыИтог.Период > ГрафикОплаты.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Остатки КАК Остатки
	|	ПО
	|		Остатки.Заявка = ГрафикОплаты.Заявка
	|		И Остатки.БанковскийСчетКасса = ГрафикОплаты.БанковскийСчетКасса
	|		
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплаты.Период,
	|	ГрафикОплаты.Заявка,
	|	ГрафикОплаты.БанковскийСчетКасса
	|	
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Остатки.КВыплате) - СУММА(ЕСТЬNULL(ГрафикОплатыИтог.КВыплате, 0)) > 0
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПлатежей.Ссылка КАК ОбъектОплаты,
	|	ГрафикПлатежей.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание) КАК ПоступлениеСписание,
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
	|			)
	|		ТОГДА
	|			Заявка.ПодотчетноеЛицо
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|			)
	|		ТОГДА
	|			Заявка.ОрганизацияПолучатель
	|		ИНАЧЕ
	|			Заявка.Контрагент
	|	КОНЕЦ КАК ПлательщикПолучатель,
	|	Заявка.Валюта КАК Валюта,
	|	
	|	ГрафикПлатежей.Сумма КАК Сумма,
	|	
	|	Заявка.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Заявка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Заявка.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА ГрафикПлатежей.БанковскийСчетКасса ССЫЛКА Справочник.Кассы ТОГДА
	|		ВЫРАЗИТЬ(ГрафикПлатежей.БанковскийСчетКасса КАК Справочник.Кассы).НаправлениеДеятельности
	|	КОГДА ГрафикПлатежей.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчетаОрганизаций ТОГДА
	|		ВЫРАЗИТЬ(ГрафикПлатежей.БанковскийСчетКасса КАК Справочник.БанковскиеСчетаОрганизаций).НаправлениеДеятельности
	|	КОГДА ГрафикПлатежей.БанковскийСчетКасса = НЕОПРЕДЕЛЕНО ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	
	|	Заявка.ПриоритетОплаты КАК Приоритет,
	|	Заявка.КтоЗаявил КАК Ответственный,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Дата КАК Дата,
	|	Заявка.Организация КАК Организация,
	|	Заявка.СуммаДокумента КАК СуммаДокумента,
	|	
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредствНеСогласованные)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредств)
	|	КОНЕЦ КАК ОбластьПланирования,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикПлатежей.БанковскийСчетКасса) = ТИП(Справочник.БанковскиеСчетаОрганизаций) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикПлатежей.БанковскийСчетКасса) = ТИП(Справочник.Кассы) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		ИНАЧЕ
	|			Заявка.ФормаОплатыЗаявки
	|	КОНЕЦ КАК ФормаОплаты
	|	
	|ИЗ
	|	ГрафикПлатежейИтог КАК ГрафикПлатежей
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО Заявка.Ссылка = ГрафикПлатежей.Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ГрафикПлатежей.Ссылка КАК ОбъектОплаты,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|			Заявка.КассаПолучатель
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|			Заявка.БанковскийСчетПолучатель
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетКасса,
	
	|	ГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление) КАК ПоступлениеСписание,
	
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|			)
	|		ТОГДА
	|			Заявка.Организация
	|		ИНАЧЕ
	|			Заявка.Контрагент
	|	КОНЕЦ КАК ПлательщикПолучатель,
	
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты) ТОГДА
	|			Заявка.ВалютаКонвертации
	|		ИНАЧЕ
	|			Заявка.Валюта
	|	КОНЕЦ КАК Валюта,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты) ТОГДА
	|			ВЫБОР
	|				КОГДА Заявка.ВалютаКонвертации = Константы.ВалютаРегламентированногоУчета ТОГДА
	|					ГрафикПлатежей.Сумма * Заявка.КурсКонвертации
	|				ИНАЧЕ
	|					ВЫБОР КОГДА Заявка.КурсКонвертации <> 0 ТОГДА
	|						ГрафикПлатежей.Сумма / Заявка.КурсКонвертации
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ГрафикПлатежей.Сумма
	|	КОНЕЦ) КАК Сумма,
	|	
	|	Заявка.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Заявка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Заявка.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|			) ТОГДА
	|				ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|					Заявка.КассаПолучатель.НаправлениеДеятельности
	|				ИНАЧЕ
	|					Заявка.БанковскийСчетПолучатель.НаправлениеДеятельности
	|				КОНЕЦ
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	
	|	Заявка.ПриоритетОплаты КАК Приоритет,
	|	Заявка.КтоЗаявил КАК Ответственный,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Дата КАК Дата,
	|	
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
	|			) ТОГДА
	|				Заявка.ОрганизацияПолучатель
	|		ИНАЧЕ
	|			Заявка.Организация
	|	КОНЕЦ КАК Организация,
	|	
	|	Заявка.СуммаДокумента КАК СуммаДокумента,
	|	
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредствНеСогласованные)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредств)
	|	КОНЕЦ КАК ОбластьПланирования,
	|	Заявка.ФормаОплатыЗаявки КАК ФормаОплаты
	|	
	|ИЗ
	|	ГрафикПлатежейИтог КАК ГрафикПлатежей
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО Заявка.Ссылка = ГрафикПлатежей.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константы
	|	ПО Истина
	|	
	|ГДЕ
	|	Заявка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
	|	)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПлатежей.Ссылка,
	|	Заявка.Ссылка,
	|	ГрафикПлатежей.ДатаПлатежа
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаГрафикПлатежейПоРаспоряжениямНаОплату()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств КАК Ссылка,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.Получатель КАК Получатель,
	|	ДенежныеСредства.Организация КАК Организация,
	|	ДенежныеСредства.СуммаОстаток КАК Сумма
	|	
	|ПОМЕСТИТЬ ДенежныеСредства
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(, ЗаявкаНаРасходованиеДенежныхСредств В (&ОбъектыОплаты)) КАК ДенежныеСредства
	|	
	|ГДЕ
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств ССЫЛКА Документ.РаспоряжениеНаПеремещениеДенежныхСредств
	|	И ДенежныеСредства.СуммаОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|///////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредства.Ссылка КАК ОбъектОплаты,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	Распоряжение.ДатаПлатежа КАК ДатаПлатежа,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Списание) КАК ПоступлениеСписание,
	|	ДенежныеСредства.Получатель КАК ПлательщикПолучатель,
	|	Распоряжение.Валюта КАК Валюта,
	|	
	|	ДенежныеСредства.Сумма КАК Сумма,
	|	
	|	Распоряжение.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Распоряжение.Подразделение КАК Подразделение,
	|	Распоряжение.КтоРешил КАК Ответственный,
	|	
	|	ВЫБОР Распоряжение.ХозяйственнаяОперация
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.Касса.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.Касса.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу) ТОГДА
	|			Распоряжение.Касса.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет) ТОГДА
	|			Распоряжение.БанковскийСчет.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка) ТОГДА
	|			Распоряжение.БанковскийСчет.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств) ТОГДА
	|			Распоряжение.БанковскийСчет.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|
	|	Распоряжение.Номер КАК Номер,
	|	Распоряжение.Дата КАК Дата,
	|	Распоряжение.Организация КАК Организация,
	|	Распоряжение.СуммаДокумента КАК СуммаДокумента,
	|
	|	ВЫБОР
	|		КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.НеСогласовано) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредствНеСогласованные)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредств)
	|	КОНЕЦ КАК ОбластьПланирования,
	|	ВЫБОР
	|		КОГДА Распоряжение.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу))
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		КОГДА Распоряжение.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств))
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	КОНЕЦ КАК ФормаОплаты
	|	
	|ИЗ
	|	ДенежныеСредства КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспоряжениеНаПеремещениеДенежныхСредств КАК Распоряжение
	|	ПО
	|		Распоряжение.Ссылка = ДенежныеСредства.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредства.Ссылка КАК ОбъектОплаты,
	|	
	|	ВЫБОР Распоряжение.ХозяйственнаяОперация
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу) ТОГДА
	|			Распоряжение.КассаПолучатель
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка) ТОГДА
	|			Распоряжение.КассаПолучатель
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств) ТОГДА
	|			Распоряжение.КассаПолучатель
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	Распоряжение.ДатаПлатежа КАК ДатаПлатежа,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДенежныхСредств.Поступление) КАК ПоступлениеСписание,
	|	ДенежныеСредства.Получатель КАК ПлательщикПолучатель,
	|	Распоряжение.Валюта КАК Валюта,
	|	
	|	ДенежныеСредства.Сумма КАК Сумма,
	|	
	|	Распоряжение.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Распоряжение.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Распоряжение.Подразделение КАК Подразделение,
	|	Распоряжение.КтоРешил КАК Ответственный,
	|	
	|	ВЫБОР Распоряжение.ХозяйственнаяОперация
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу) ТОГДА
	|			Распоряжение.КассаПолучатель.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет) ТОГДА
	|			Распоряжение.БанковскийСчетПолучатель.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка) ТОГДА
	|			Распоряжение.КассаПолучатель.НаправлениеДеятельности
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств) ТОГДА
	|			Распоряжение.КассаПолучатель.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	
	|	Распоряжение.Номер КАК Номер,
	|	Распоряжение.Дата КАК Дата,
	|	Распоряжение.Организация КАК Организация,
	|	Распоряжение.СуммаДокумента КАК СуммаДокумента,
	|
	|	ВЫБОР КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.НеСогласовано) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредствНеСогласованные)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредств)
	|	КОНЕЦ КАК ОбластьПланирования,
	|	ВЫБОР
	|		КОГДА Распоряжение.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств))
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		КОГДА Распоряжение.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет))
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	КОНЕЦ КАК ФормаОплаты
	|
	|ИЗ
	|	ДенежныеСредства КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспоряжениеНаПеремещениеДенежныхСредств КАК Распоряжение
	|	ПО
	|		Распоряжение.Ссылка = ДенежныеСредства.Ссылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИнициализироватьПоляГрафика()
	
	ПоляГрафика = Новый Структура("Ссылка, БанковскийСчет, БанковскийСчетОрганизации, Касса, СтатьяДвиженияДенежныхСредств, НаправлениеДеятельности,
		|ХозяйственнаяОперация, Подразделение, Приоритет, Менеджер, Номер, Дата, СуммаДокумента, ФормаОплаты,
		|ДоговорСтатьяДвиженияДенежныхСредств, СоглашениеСтатьяДвиженияДенежныхСредств");
		
	ПоляГрафика.Вставить("Сумма", "СуммаДокумента");
	
	Возврат ПоляГрафика;
	
КонецФункции

#КонецОбласти

#Область Обновление

#КонецОбласти

#КонецЕсли
